{"modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "SGD", "config": {"nesterov": false, "lr": 9.999999747378752e-05, "momentum": 0.8999999761581421, "decay": 0.0}}, "weighted_metrics": null, "sample_weight_mode": null}, "keras_version": "2.1.6-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation"}, "name": "activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_1"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_2", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_2"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "name": "activation_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"name": "max_pooling2d", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_3", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_3"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}, "name": "activation_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_4", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_4"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_4"}, "name": "activation_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_8", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_8"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_8"}, "name": "activation_8"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_6"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_9", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_6", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_9", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_9"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_6"}, "name": "activation_6"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_9"}, "name": "activation_9"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"name": "average_pooling2d", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_10", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_11", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_11"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_5", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_7", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_10", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_10"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_11", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_11"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_5"}, "name": "activation_5"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_7"}, "name": "activation_7"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_10"}, "name": "activation_10"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_11"}, "name": "activation_11"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_5", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_10", 0, 0, {}], ["activation_11", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_15", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_15", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_15"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_15"}, "name": "activation_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_13", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_13"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_16", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_13", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_16", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_16"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_13"}, "name": "activation_13"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_16"}, "name": "activation_16"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "average_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_12", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_12"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_14", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_14"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_18"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_12", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_14", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_17", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_17"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_18", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_18"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_12"}, "name": "activation_12"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_14"}, "name": "activation_14"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_17"}, "name": "activation_17"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_18"}, "name": "activation_18"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_12", 0, 0, {}], ["activation_14", 0, 0, {}], ["activation_17", 0, 0, {}], ["activation_18", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_22"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_22", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_22"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_22"}, "name": "activation_22"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_20"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_23"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_20", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_20"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_23", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_23"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_20"}, "name": "activation_20"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_23"}, "name": "activation_23"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "average_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_19"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_21"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_24"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_25"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_19", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_19"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_21", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_21"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_24", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_24"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_25", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_25"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_19"}, "name": "activation_19"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_21"}, "name": "activation_21"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_24"}, "name": "activation_24"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_25"}, "name": "activation_25"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_27"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_27", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_27"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_27"}, "name": "activation_27"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_28"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_28", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_28"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_28"}, "name": "activation_28"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_26", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_26"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "conv2d_29", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_29"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_26", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_26"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_29", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": false, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "batch_normalization_29"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_26"}, "name": "activation_26"}, {"class_name": 